SIMISA@@@@@@@@@@JINX0D0t______

 Wagon ( #MT_DD_CLASS_37_37191
 Comment ( Model, textures and supporting files are copyright Making Tracks Rail Simulations Software 2008 )
 Comment ( File lasted edited by DD 05/01/2009 )
Type ( Engine )
 WagonShape ( MT_DD_CLASS_37_37191.s )
 Size ( 2.700262m 3.89927m 18.732m )
 Mass ( 106.0t)
 WheelRadius ( 0.596m )
 InertiaTensor ( Box ( 2.591983m 3.735878m 17.3684m ) )
 Coupling (
 Type ( Automatic )
 Spring (
 Stiffness ( 1e6N/m 5e6N/m )
 Damping ( 1e6N/m/s 1e6N/m/s )
 Break ( 3.2e6N 3.2e6N )
 r0 ( 20cm 30cm )
 )
 
 Velocity ( 0.1m/s )
 )
 Buffers (
 Spring (
 Stiffness ( 1e6N/m 5e6N/m )
 Damping ( 1e6N/m/s 1e6N/m/s )
 r0 ( 0m 1e9 )
 )
 Centre ( 0.5 )
 Radius ( 1 )
 Angle ( 0.5deg )
 )
 
 Antislip ( 1 )
Adheasion ( 0.1 0.5 0.43 0 )
 DerailRailHeight ( 4cm )
 DerailRailForce ( 2.5*250e3lbs )
 DerailBufferForce ( 200kN )
 NumWheels ( 6 )
 Friction (
 1449.6N/m/s -0.10 1.2mph 11.248N/m/s 1.853
 5.1N/rad/s 1 -1rad/s 0 1
 )

 BrakeEquipmentType ( "Triple_valve, Auxilary_reservoir, Emergency_brake_reservoir" )

 BrakeSystemType ( "Air_single_pipe" )
 MaxBrakeForce ( 490kN )

 EmergencyBrakeResMaxPressure( 110 )
 TripleValveRatio( 3.5 )
 MaxReleaseRate( 20 )
 MaxApplicationRate( 20 )
 MaxAuxilaryChargingRate( 35 )
 EmergencyResCapacity( 10 )
 EmergencyResChargingRate( 30 )
 BrakeCylinderPressureForMaxBrakeBrakeForce( 70 )

 IntakePoint ( -2.4 0.4 FuelDiesel )
 IntakePoint ( 2.4 0.4 FuelDiesel )

 Lights ( 8
 
 comment ( *** forward lights *** )
 
 Light (
 
 Type ( 0 )
 Conditions (
 Control ( 0 )
 Service ( 2 )
 Unit ( 2 )
 )
 FadeIn ( 0.2 )
 FadeOut ( 0.5 )
 Cycle ( 0 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( 90ffcc60 )
 Position ( 0.415 2.32 9.02 )
 Azimuth ( 0.0 -0.0 0.0 )
 Transition ( 0 )
 Radius ( 0.3 )
 )
 )
 )
 Light (
 
 Type ( 0 )
 Conditions (
 Control ( 0 )
 Service ( 2 )
 Unit ( 2 )
 )
 FadeIn ( 0.2 )
 FadeOut ( 0.5 )
 Cycle ( 0 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( 90ffcc60 )
 Position ( -0.415 2.32 9.02 )
 Azimuth ( 0.0 -0.0 0.0 )
 Transition ( 0 )
 Radius ( 0.3 )
 )
 )
 )
 Light (
 
 Type ( 0 )
 Conditions (
 Control ( 0 )
 Service ( 2 )
 Unit ( 3 )
 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 Cycle ( 0 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( 80dd1520 )
 Position ( 0.95 1.7 -8.94 )
 Azimuth ( -180 -180 -180 )
 Transition ( 0 )
 Radius ( 0.3 )
 )
 )
 )

 Light (
 
 Type ( 0 )
 Conditions (
 Control ( 0 )
 Service ( 2 )
 Unit ( 3 )
 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 Cycle ( 0 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( 80dd1520 )
 Position ( -0.95 1.7 -8.94 )
 Azimuth ( -180 -180 -180 )
 Transition ( 0 )
 Radius ( 0.3 )
 )
 )
 )


comment ( ** Stationary Lights ** )


 Light (
 
 Type ( 0 )
 Conditions (
 Control ( 0 )
 Service ( 1 )
 Unit ( 3 )
 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 Cycle ( 0 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( 80dd1520 )
 Position ( 0.95 1.7 -8.94 )
 Azimuth ( -180 -180 -180 )
 Transition ( 0 )
 Radius ( 0.3 )
 )
 )
 )

 Light (
 
 Type ( 0 )
 Conditions (
 Control ( 0 )
 Service ( 1 )
 Unit ( 3 )
 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 Cycle ( 0 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( 80dd1520 )
 Position ( -0.95 1.7 -8.94 )
 Azimuth ( -180 -180 -180 )
 Transition ( 0 )
 Radius ( 0.3 )
 )
 )
 )

 Light (
 
 Type ( 0 )
 Conditions (
 Control ( 0 )
 Service ( 1 )
 Unit ( 4 )
 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 Cycle ( 0 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( 80dd1520 )
 Position ( -0.95 1.7 8.94 )
 Transition ( 0 )
 Radius ( 0.3 )
 )
 )
 )

 Light (
 
 Type ( 0 )
 Conditions (
 Control ( 0 )
 Service ( 1 )
 Unit ( 4 )
 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 Cycle ( 0 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( 80dd1520 )
 Position ( 0.95 1.7 8.94 )
 Transition ( 0 )
 Radius ( 0.3 )
 )
 )
 )

)
  Sound ( "..\\..\\MT_Common.Sound\\MT_Class37\\#Class37-01.sms" )
 )

 Engine ( #MT_DD_CLASS_37_37191
 Effects
 (
 DieselSpecialEffects
 (
 comment
 (
 the format of these little blocks is as follow:

 offset.x offset.y offset.z
 normal.x normal.y normal.z
 width in metres

 defining the offset from the shape pivot point
 where steam / smoke should appear, the direction
 it should go and the width of the nozzle
 )

 Exhaust1
 (
 0.65 3.90 -0.625
 0.25 1 0
 0.1
 )
 Exhaust2
 (
 -0.65 3.90 -0.625
 -0.25 1 0
 0.1
 )
 )
 )
 
 Wagon ( #MT_DD_CLASS_37_37191 )
 Type ( Diesel )
 MaxPower ( 1250hp )
 MaxForce ( 246.876kN ) 
 MaxContinuousForce ( 146.791kN )
 MaxVelocity ( 90mph )
 MaxCurrent ( 2600A ) 
 WheelRadius ( 21.5in )
 
 Sanding ( 1e9mph )

 NumWheels ( 1.5 )
 MaxTemperature ( 120 )
 MaxOilPressure ( 90 )

 
 
 MaxDieselLevel ( 890gal )
 DieselUsedPerHourAtMaxPower ( 93gal )
 DieselUsedPerHourAtIdle ( 6.4gal )

 
 
 AirBrakesAirCompressorPowerRating( 1.7 )
 AirBrakesMainMinResAirPressure( 0 )
 AirBrakesMainMaxAirPressure( 130 )
 AirBrakesMainResVolume( 8 )
 AirBrakesAirCompressorWattage( 19000 )
 AirBrakesCompressorRestartPressure( 125 )
 AirBrakesAirUsedPerPoundsOfBrakePipePressure( 0.27 )
 AirBrakesHasLowPressureTest( 1 )
 AirBrakesIsCompressorElectricOrMechanical( 1 )

 EngineBrakesControllerMinPressureReduction( 6 )
 TrainBrakesControllerMinPressureReduction( 6 )
 EngineBrakesControllerHasProportionalBrake( 1 )
 EngineBrakesProportionalBrakeLag( 1.2 )
 EngineBrakesControllerMaxApplicationRate( 20 )
 TrainBrakesControllerMaxApplicationRate( 10 )
 EngineBrakesControllerMaxReleaseRate( 20 )
 TrainBrakesControllerMaxReleaseRate( 4 )
 EngineBrakesControllerEmergencyApplicationRate( 50 )
 TrainBrakesControllerEmergencyApplicationRate( 50 )
 EngineBrakesControllerMinSystemPressure( 50 )
 TrainBrakesControllerMinSystemPressure( 50 )
 EngineBrakesControllerMaxSystemPressure( 90 )
 TrainBrakesControllerMaxSystemPressure( 90 )
 EngineBrakesControllerEmergencyBrakeTimePenalty( 0 )
 TrainBrakesControllerEmergencyBrakeTimePenalty( 0 )
 EngineBrakesControllerFullServicePressureDrop( 26 )
 TrainBrakesControllerFullServicePressureDrop( 26 )


 BrakesEngineBrakeType ( "Air_single_pipe" )
 BrakesTrainBrakeType ( "Air_single_pipe" )
 BrakesEngineControllers( "Independent, Train" )




 
 EngineBrakesControllerDirectControlExponent( 1 )

 (* Excessive smoke in ORTS so reduced values to 1/4
 DieselSmokeEffectInitialMagnitude( 1.2 )
 DieselSmokeEffectMaxMagnitude( 4.0 )
 DieselSmokeEffectInitialSmokeRate( 1.8 )
 DieselSmokeEffectMaxSmokeRate( 10.0 ) 
 *)
 DieselSmokeEffectInitialMagnitude( 0.3 )
 DieselSmokeEffectMaxMagnitude( 1.0 )
 DieselSmokeEffectInitialSmokeRate( 0.95)
 DieselSmokeEffectMaxSmokeRate( 2.5 )
 
 DieselEngineIdleRPM( 450 )
 DieselEngineMaxRPM( 850 )
 DieselEngineSpeedOfMaxTractiveEffort( 13.6mph ) 
 DieselEngineMaxRPMChangeRate( 200 )

 DoesHornTriggerBell( 0 )

 EmergencyStopMonitor(
 MonitoringDeviceMonitorTimeLimit( 0 )
 MonitoringDeviceAlarmTimeLimit( 0 )
 MonitoringDevicePenaltyTimeLimit( 0 )
 MonitoringDeviceCriticalLevel( 0 )
 MonitoringDeviceResetLevel( 0 )
 MonitoringDeviceAppliesFullBrake( 0 )
 MonitoringDeviceAppliesEmergencyBrake( 1 )
 MonitoringDeviceAppliesCutsPower( 0 )
 MonitoringDeviceAppliesShutsDownEngine( 0 )
 )

 AWSMonitor(
 MonitoringDeviceMonitorTimeLimit( -1 )
 MonitoringDeviceAlarmTimeLimit( 5 )
 MonitoringDevicePenaltyTimeLimit( 0 )
 MonitoringDeviceCriticalLevel( 0 )
 MonitoringDeviceResetLevel( 0 )
 MonitoringDeviceAppliesFullBrake( 0 )
 MonitoringDeviceAppliesEmergencyBrake( 1 )
 MonitoringDeviceAppliesCutsPower( 0 )
 MonitoringDeviceAppliesShutsDownEngine( 0 )
 )
 
 EngineVariables( 3600 )
 
 
 
 EngineControllers (
 Throttle ( 0 1 0.125 0 0.
 NumNotches ( 9
 Notch ( 0 0 Dummy )
 Notch ( 0.125 0 Dummy )
 Notch ( 0.25 0 Dummy )
 Notch ( 0.375 0 Dummy )
 Notch ( 0.5 0 Dummy )
 Notch ( 0.625 0 Dummy )
 Notch ( 0.75 0 Dummy )
 Notch ( 0.875 0 Dummy )
 Notch ( 1 0 Dummy )
 )
 )
 Brake_Engine ( 0 1 0.0125 0
 NumNotches ( 1
 Notch( 0 1 Dummy )
 )
 )
 Brake_Train ( 0 1 0.0125 0.75
 NumNotches ( 4
 Notch( 0 0 TrainBrakesControllerReleaseStart )
 Notch( 0.15 1 TrainBrakesControllerGraduatedSelfLapLimitedHoldingStart )
 Notch( 0.65 0 TrainBrakesControllerSuppressionStart )
 Notch( 0.8 0 TrainBrakesControllerContinuousServiceStart )



 )
 )
 DirControl ( -1 0 1 1 )
 BellToggle( 0 1 0 )
 AWS ( 0 1 0 )
 Sanding ( 0 1 0 )
 Horn ( 0 1 0 )
 Wipers ( 0 1 0 )
 EmergencyStopResetToggle( 0 1 0 )
 EmergencyStopToggle( 0 1 0 )
 Vigilance ( 0 1 0 )
 Headlights ( 0 0.25 1 0 )
 BailOffButton( 0 1 0 )
 )
 
 
 Name ("#MT Class 37 37191 BR Blue")
 Description (
 "Type3 Co-Co Class37 diesel-electric locomotive\n\n"+
 "Built by English Electric 1960-1965\n\n"+
 "Refurbished and alternator fitted 1980's\n\n"+
 "Numbers: 37001 to 37315\n\n"+
 "Locomotive type: Diesel-Electric\n\n"+
 "Power source: Diesel engine English Electric 12CSVT 12cyl\n\n"+
 "Power: 1,750 hp @ 850rpm \n\n"+
 "Power at Rail: 1,250 hp \n\n"+
 "Maximum speed: 80 mph \n\n"+
 "Route Availability: 5 \n\n"+
 "Coupling Code: Blue Star\n\n"+
 "Brake Force: 50ton, Type: Vacuum/Air\n\n"+
 "Generator (rectified output): English Electric EE822\n\n"+
 "Traction motors: Six English Electric EE538/A, series wound, axle-hung\n\n"+
 "Maximum tractive effort: 55,500lbf \n\n"+
 "Continuous tractive effort: 33,000 lbf @ 13.6mph\n\n"+
 "Wheel configuration: Twelve tapered tread in two 6 wheel bogies\n\n"+
 "Weight: 106-107 tons \n\n"+
 "Height: 12 ft. 9 1/2 in. (3.9 m)\n\n"+
 "Length: 61 ft. 6 in. (18.75 m)\n\n"+
 "Width: 8 ft. 10 3/8 in. (2.7 m)"
 "Model (c) 2008 Daryn Dunkley\n\n"+
 "Textures (c) 2008 Daryn Dunkley"
 )
 EngineOperatingProcedures (
 "To move forward\n"+
 "1. Press the W key to move the Reverser to Forward.\n"+
 "2. Press the ; (SEMICOLON) key to release the train brakes.\n"+
 "3. Press the [ (LEFT BRACKET) key to release the locomotive brake.\n"+
 "4. Press the D key to move the throttle from Idle to Notch 1.\n"+
 "5. Gradually increase power (D key), one notch at a time, until your train reaches the desired speed.\n\n"+
 "To slow the train\n"+
 "1. Press the A key to move the throttle to a lower setting.\n"+
 "2. Use the brakes to further reduce speed if desired.\n\n"+
 "To apply the dynamic brakes\n"+
 "1. Press the A key to move the throttle to the Idle position.\n"+
 "2. Wait for 10 seconds, then press the . (PERIOD) key to advance the Dynamic Brake handle from Off to the Setup position. After allowing a few seconds for braking circuit setup, press the . (PERIOD) key again to set the desired level of dynamic braking (Levels 1 - 8).\n\n"+
 "To release the dynamic brakes\n"+
 "1. Press the D key to move the throttle towards Idle.\n\n"+
 "To apply the train brakes\n"+
 "1. Press the ' (APOSTROPHE) key to apply the train brakes.\n\n"+
 "To bail off the train brakes on the locomotive\n"+
 "1. Press the / (FORWARD SLASH) key.\n\n"+
 "To release the train brakes\n"+
 "1. Press the ; (SEMICOLON) key to release the train brakes.\n\n"+
 "To apply the locomotive brake\n"+
 "1. Press the ] (RIGHT BRACKET) key to apply the locomotive brake.\n\n"+
 "To release the locomotive brake\n"+
 "1. Press the [ (LEFT BRACKET) key to release the locomotive brake.\n\n"+
 "To activate emergency braking\n"+
 "1. Press the A key to reduce the throttle to Idle.\n"+
 "2. Press the BACKSPACE key to activate emergency braking.\n\n"+
 "To back up\n"+
 "1. Bring your train to a full stop.\n"+
 "2. Press the S key to move the Reverser to the Reverse position.\n"+
 "3. Release the brakes.\n"+
 "4. Slowly advance the throttle lever (D key).\n\n"+
 "To couple to a car or locomotive\n"+
 "1. Coast into the unit at a very slow speed, about 2 mph.\n"+
 "TIP: To use the Coupling view, press the 6 key.\n"+
 "2. Press F9 to open the Train Operations window.\n"+
 "3. If the icon for the unit you coupled to is red, the handbrake is on. Double-click the car to release the handbrake.\n"+
 "4. Close the Train Operations window.\n\n"+
 "To uncouple from a car or locomotive\n"+
 "1. Press F9 to open the Train Operations window.\n"+
 "2. Double-click a unit in the part of the train you want to uncouple from the locomotive, to set the handbrake.\n"+
 "3. Double-click the coupler between the units you want to uncouple and the rest of the train.\n"+
 "4. Close the Train Operations window."
 ) 
)